export const districts = [
  "강남구",
  "강서구",
  "강북구",
  "강동구",
  "관악구",
  "노원구",
  "마포구",
  "서초구",
  "송파구",
  "영등포구",
  "은평구",
  "종로구",
] as const;

export type Districts = (typeof districts)[number];

export const districtCoordinates = {
  강남구: { lat: 37.5172363, lng: 127.0473248 },
  강서구: { lat: 37.5509645, lng: 126.849532 },
  강북구: { lat: 37.6397511, lng: 127.0251595 },
  강동구: { lat: 37.5301251, lng: 127.1237629 },
  관악구: { lat: 37.4787191, lng: 126.9519779 },
  노원구: { lat: 37.6542584, lng: 127.0565845 },
  마포구: { lat: 37.563761, lng: 126.908421 },
  서초구: { lat: 37.4835754, lng: 127.0326464 },
  송파구: { lat: 37.5145432, lng: 127.1059212 },
  영등포구: { lat: 37.5263943, lng: 126.8963031 },
  은평구: { lat: 37.6185557, lng: 126.9273747 },
  종로구: { lat: 37.5729503, lng: 126.9793579 },
};
